dependencies/OpenFOAM/modules/OpenQBMM/validation/diluteVdfTransportFoam/riser/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        smoother        DIC;
        preconditioner  DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     2;
        tolerance       1e-10;
        maxIter         1000;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|e).air"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

    "(U|e).airFinal"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

    "(moment.*|velocityAbscissa.*)"
    {
        solver          diagonal;
        tolerance       1e-12;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    15;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefPoint (0.016 0.15 0.01);
    pRefValue 1e5;
    momentumPredictor on;

    outerCorrectorResidualControl
    {
        p
        {
            tolerance 1e-4;
            relTol    0;
        }
    }
}

relaxationFactors
{
    fields
    {
        p           0.3;
    }
    equations
    {
        "U.*"       0.7;
    }
}


// ************************************************************************* //
