dependencies/OpenFOAM/modules/OpenQBMM/validation/diluteVdfTransportFoam/riser/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type      phaseIncompressibleMeanVelocityForce;

    Ubar            (0 1.0 0);
    alphaName       alpha.air;
    fields          (U.air);
    selectionMode   all;

    volumeMode      specific;
}


// ************************************************************************* //
